artillery/tests/boards.scenario.yaml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 100
      arrivalRate: 100

before:
  flow:
    - log: 'Get auth token'
    - post:
        url: '/login'
        json:
          login: 'admin'
          password: 'admin'
        capture:
          - json: $.token
            as: token

scenarios:
  - flow:
      - log: 'Get all boards'
      - get:
          url: '/boards'
          headers:
            authorization: 'Bearer {{ token }}'

  - flow:
      - log: 'Board CURD'
      - post:
          url: '/boards'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            title: 'test-title'
            columns:
              - order: 1
                title: 'test-title-1'
          capture:
            - json: $.id
              as: boardId

      - put:
          url: '/boards/{{ boardId }}'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            title: 'new-test-title'
            columns:
              - order: 1
                title: 'test-title-1'
              - order: 2
                title: 'test-title-2'

      - get:
          url: '/boards/{{ boardId }}'
          headers:
            authorization: 'Bearer {{ token }}'

      - delete:
          url: '/boards/{{ boardId }}'
          headers:
            authorization: 'Bearer {{ token }}'