artillery/tests/login.scenario.yaml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 100
      arrivalRate: 100

scenarios:
  - flow:
      - log: 'login'
      - post:
          url: '/login'
          json:
            login: 'admin'
            password: 'admin'
          capture:
            - json: $.token
              as: token